app/controllers/home_controller.rb

  def index

  	if current_user.nil?
  	else
  		if current_user.has_role? :admin
  			@info_requests = InfoRequest.select("info_requests.*, users.name").
   	     		joins('LEFT OUTER JOIN users ON users.id = info_requests.creator_id')

  		else
  			@info_requests = InfoRequest.select("info_requests.*, users.name").
   	     		joins('LEFT OUTER JOIN users ON users.id = info_requests.creator_id').where("creator_id = #{current_user.id}")
---
SELECT info_requests.*, users.* FROM "info_requests" LEFT OUTER JOIN users ON users.id = info_requests.creator_id WHERE (info_requests.creator_id = 2)
SELECT info_requests.*, users.name FROM "info_requests" LEFT OUTER JOIN users ON users.id = info_requests.creator_id WHERE "info_requests"."id" = ? AND (creator_id = 3) LIMIT 1  [["id", "2"]]