app/controllers/users_controller.rb

  def index
    authorize! :index, @user, :message => 'NO TIENE PERMISO PARA VER ESTA PAGINA.'
    @users = User.all
---
SELECT "users".* FROM "users"